In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv("BMI.csv")

In [3]:
df

     Gender  Height  Weight  Index
0      Male     174      96      4
1      Male     189      87      2
2    Female     185     110      4
3    Female     195     104      3
4      Male     149      61      3
..      ...     ...     ...    ...
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

[500 rows x 4 columns]

In [4]:
df.count()

Gender    500
Height    500
Weight    500
Index     500
dtype: int64

In [5]:
df.shape

(500, 4)

In [11]:
print(df.head(n=10).to_string(index=False))

 Gender  Height  Weight  Index
   Male     174      96      4
   Male     189      87      2
 Female     185     110      4
 Female     195     104      3
   Male     149      61      3
   Male     189     104      3
   Male     147      92      5
   Male     154     111      5
   Male     174      90      3
 Female     169     103      4

In [20]:
df[10:11]

   Gender  Height  Weight  Index
10   Male     195      81      2

In [21]:
dummies=pd.get_dummies(df['Gender'])
dummies

     Female  Male
0         0     1
1         0     1
2         1     0
3         1     0
4         0     1
..      ...   ...
495       1     0
496       1     0
497       1     0
498       0     1
499       0     1

[500 rows x 2 columns]

In [22]:
merged=pd.concat([df,dummies],axis='columns')
merged

     Gender  Height  Weight  Index  Female  Male
0      Male     174      96      4       0     1
1      Male     189      87      2       0     1
2    Female     185     110      4       1     0
3    Female     195     104      3       1     0
4      Male     149      61      3       0     1
..      ...     ...     ...    ...     ...   ...
495  Female     150     153      5       1     0
496  Female     184     121      4       1     0
497  Female     141     136      5       1     0
498    Male     150      95      5       0     1
499    Male     173     131      5       0     1

[500 rows x 6 columns]

In [23]:
final=merged.drop(['Gender','Female'],axis='columns')
final

     Height  Weight  Index  Male
0       174      96      4     1
1       189      87      2     1
2       185     110      4     0
3       195     104      3     0
4       149      61      3     1
..      ...     ...    ...   ...
495     150     153      5     0
496     184     121      4     0
497     141     136      5     0
498     150      95      5     1
499     173     131      5     1

[500 rows x 4 columns]